# Задание 1


# Задание 2
# crt = ('ab', 'abcd', 'cde', 'abc', 'def')
# s = input('-> ')
# if s in crt:
#     print('Yes')
# else:
#     print('No')


# Задание 3
# crt = tuple(input('Введите по порядку, без пробелов, элементы кортежа: '))
# print(crt)
# for i in crt:
#     print('Количество', i, '=', crt.count(i))
